[
    {
        "headline": "สตาร์ทอัพไทยระดมทุน 100 ล้านบาท พัฒนาแพลตฟอร์ม AI",
        "body": "บริษัทสตาร์ทอัพด้านเทคโนโลยีของไทยประกาศระดมทุนรอบ Series A มูลค่า 100 ล้านบาท เพื่อพัฒนาแพลตฟอร์มปัญญาประดิษฐ์สำหรับธุรกิจ",
        "actual": "Business",
        "predicted": "SciTech",
        "errorType": "Mixed Signal",
        "reason": "ข่าวมีทั้งเนื้อหา Business (ระดมทุน, Series A) และ SciTech (AI, เทคโนโลยี, ปัญญาประดิษฐ์) ทำให้โมเดลจับคีย์เวิร์ดด้าน Tech มากกว่า"
    },
    {
        "headline": "องค์การอนามัยโลกเตือนวิกฤตสุขภาพจากมลพิษ",
        "body": "WHO ออกรายงานเตือนว่าประเทศต่างๆ ทั่วโลกต้องเผชิญวิกฤตสุขภาพจากมลพิษทางอากาศ โดยเฉพาะในเขตเมืองใหญ่",
        "actual": "World",
        "predicted": "SciTech",
        "errorType": "Domain Shift",
        "reason": "คำศัพท์ด้านสุขภาพและวิทยาศาสตร์ (มลพิษ, สุขภาพ, รายงาน) ทำให้โมเดลเข้าใจผิดว่าเป็นข่าว SciTech แทนที่จะเป็นข่าวโลก"
    },
    {
        "headline": "รัฐบาลจีนประกาศมาตรการกระตุ้นเศรษฐกิจครั้งใหญ่",
        "body": "รัฐบาลจีนประกาศแพ็คเกจกระตุ้นเศรษฐกิจมูลค่ากว่า 1 ล้านล้านหยวน เพื่อฟื้นฟูเศรษฐกิจหลังชะลอตัว",
        "actual": "World",
        "predicted": "Business",
        "errorType": "Mixed Signal",
        "reason": "เนื้อหาเกี่ยวกับเศรษฐกิจ (กระตุ้นเศรษฐกิจ, มูลค่า, หยวน) แต่เป็นข่าวต่างประเทศ โมเดลจับคีย์เวิร์ด 'เศรษฐกิจ' มากกว่า 'จีน'"
    },
    {
        "headline": "บริษัทไบโอเทคไทยส่งออกวัคซีนสู่ตลาดโลก",
        "body": "บริษัทผลิตวัคซีนของไทยลงนามข้อตกลงส่งออกวัคซีนไปยัง 10 ประเทศในอาเซียน มูลค่ากว่า 5,000 ล้านบาท",
        "actual": "Business",
        "predicted": "SciTech",
        "errorType": "Mixed Signal",
        "reason": "คำว่า 'ไบโอเทค' และ 'วัคซีน' ทำให้โมเดลคิดว่าเป็นข่าววิทยาศาสตร์ ทั้งที่เนื้อหาหลักคือการส่งออกและมูลค่าทางธุรกิจ"
    },
    {
        "headline": "ธนาคารโลกปรับลดคาดการณ์ GDP โลก",
        "body": "ธนาคารโลกประกาศปรับลดประมาณการอัตราการเติบโตทางเศรษฐกิจโลกลงเหลือ 2.1% จากความไม่แน่นอนทางภูมิรัฐศาสตร์",
        "actual": "World",
        "predicted": "Business",
        "errorType": "Mixed Signal",
        "reason": "คำศัพท์ทางเศรษฐกิจ (GDP, อัตราการเติบโต, เศรษฐกิจ) ทำให้โมเดลจัดเป็น Business แทนที่จะเป็นข่าวโลก"
    },
    {
        "headline": "สถาบันวิจัยเผยผลศึกษาผลกระทบเศรษฐกิจดิจิทัล",
        "body": "สถาบันวิจัยเศรษฐกิจดิจิทัลเผยผลศึกษาว่า เศรษฐกิจดิจิทัลของไทยมีมูลค่าสูงถึง 1 ล้านล้านบาท คิดเป็น 20% ของ GDP",
        "actual": "SciTech",
        "predicted": "Business",
        "errorType": "Domain Shift",
        "reason": "แม้เป็นงานวิจัยด้านเทคโนโลยี แต่คำว่า 'เศรษฐกิจ', 'มูลค่า', 'GDP' ทำให้โมเดลจัดเป็น Business"
    },
    {
        "headline": "EU อนุมัติกฎหมายควบคุม AI ฉบับแรกของโลก",
        "body": "สหภาพยุโรปผ่านกฎหมาย AI Act ซึ่งเป็นกฎหมายควบคุมปัญญาประดิษฐ์ฉบับแรกของโลก กำหนดข้อบังคับและบทลงโทษสำหรับการใช้ AI ที่มีความเสี่ยง",
        "actual": "World",
        "predicted": "SciTech",
        "errorType": "Mixed Signal",
        "reason": "เนื้อหาเกี่ยวกับ AI และเทคโนโลยี แต่เป็นข่าวการเมืองระหว่างประเทศ โมเดลจับคีย์เวิร์ด 'AI' และ 'ปัญญาประดิษฐ์'"
    },
    {
        "headline": "กองทุนเทคโนโลยีระดมทุน 10,000 ล้านบาท",
        "body": "กองทุนร่วมลงทุนด้านเทคโนโลยีชั้นนำประกาศปิดระดมทุนรอบใหม่ มูลค่ารวม 10,000 ล้านบาท เพื่อลงทุนในสตาร์ทอัพ AI และ Fintech",
        "actual": "Business",
        "predicted": "SciTech",
        "errorType": "Mixed Signal",
        "reason": "แม้เป็นข่าวการลงทุน แต่คำว่า 'เทคโนโลยี', 'AI', 'Fintech', 'สตาร์ทอัพ' ทำให้โมเดลจัดเป็น SciTech"
    },
    {
        "headline": "นักวิทยาศาสตร์จีนค้นพบสารต้านมะเร็งชนิดใหม่",
        "body": "ทีมวิจัยจากมหาวิทยาลัยปักกิ่งประกาศค้นพบสารประกอบใหม่ที่มีประสิทธิภาพในการยับยั้งเซลล์มะเร็ง คาดว่าจะเปลี่ยนแปลงการรักษาในอนาคต",
        "actual": "SciTech",
        "predicted": "World",
        "errorType": "Domain Shift",
        "reason": "คำว่า 'จีน' และ 'ปักกิ่ง' ทำให้โมเดลคิดว่าเป็นข่าวต่างประเทศ แทนที่จะเป็นข่าววิทยาศาสตร์"
    },
    {
        "headline": "ตลาดหลักทรัพย์สหรัฐฯ ปิดร่วงหนัก",
        "body": "ดัชนี Dow Jones ปิดร่วงกว่า 500 จุด หลังนักลงทุนกังวลเรื่องเงินเฟ้อและการขึ้นดอกเบี้ยของ Fed",
        "actual": "Business",
        "predicted": "World",
        "errorType": "Domain Shift",
        "reason": "คำว่า 'สหรัฐฯ' และ 'Fed' ทำให้โมเดลจัดเป็นข่าวโลก ทั้งที่เนื้อหาหลักเป็นเรื่องตลาดหุ้น"
    },
    {
        "headline": "อินเดียส่งยานอวกาศสำรวจดวงจันทร์สำเร็จ",
        "body": "องค์การอวกาศอินเดีย (ISRO) ประกาศความสำเร็จในการส่งยาน Chandrayaan-3 ลงจอดบนดวงจันทร์ กลายเป็นประเทศที่ 4 ที่ทำได้",
        "actual": "SciTech",
        "predicted": "World",
        "errorType": "Mixed Signal",
        "reason": "แม้เป็นข่าววิทยาศาสตร์อวกาศ แต่คำว่า 'อินเดีย' และ 'ประเทศที่ 4' ทำให้โมเดลจัดเป็นข่าวโลก"
    },
    {
        "headline": "บริษัทญี่ปุ่นเปิดตัวหุ่นยนต์บริการในร้านอาหาร",
        "body": "เครือร้านอาหารญี่ปุ่นนำหุ่นยนต์เสิร์ฟอาหารมาใช้งาน เพื่อแก้ปัญหาขาดแคลนแรงงานและลดต้นทุน",
        "actual": "SciTech",
        "predicted": "Business",
        "errorType": "Mixed Signal",
        "reason": "แม้เป็นข่าวเทคโนโลยีหุ่นยนต์ แต่คำว่า 'แรงงาน', 'ต้นทุน', 'เครือร้านอาหาร' ทำให้โมเดลจัดเป็น Business"
    }
]