[
    {
        "headline": "ตลาดหุ้นไทยปิดบวก 15 จุด รับแรงซื้อหุ้นพลังงาน",
        "body": "ดัชนีตลาดหลักทรัพย์แห่งประเทศไทย ปิดการซื้อขายวันนี้ที่ระดับ 1,450 จุด เพิ่มขึ้น 15 จุด โดยได้รับแรงหนุนจากกลุ่มหุ้นพลังงานและธนาคาร นักวิเคราะห์คาดการณ์ว่าตลาดจะยังคงแนวโน้มขาขึ้นต่อไป",
        "topic": "Business"
    },
    {
        "headline": "ธนาคารกลางประกาศคงอัตราดอกเบี้ยนโยบาย",
        "body": "คณะกรรมการนโยบายการเงินมีมติคงอัตราดอกเบี้ยนโยบายไว้ที่ระดับ 2.5% โดยประเมินว่าเศรษฐกิจยังขยายตัวได้ตามคาด แม้จะมีความเสี่ยงจากปัจจัยภายนอก",
        "topic": "Business"
    },
    {
        "headline": "บริษัทน้ำมันยักษ์ใหญ่รายงานกำไรไตรมาส 3 เพิ่มขึ้น 25%",
        "body": "บริษัทพลังงานรายใหญ่ของไทยประกาศผลประกอบการไตรมาส 3 มีกำไรสุทธิ 15,000 ล้านบาท เพิ่มขึ้น 25% จากปีก่อน โดยได้รับผลบวกจากราคาน้ำมันที่ปรับตัวสูงขึ้น",
        "topic": "Business"
    },
    {
        "headline": "สมาคมธนาคารไทยคาดสินเชื่อปีนี้โต 5%",
        "body": "นายกสมาคมธนาคารไทยเปิดเผยว่า คาดการณ์สินเชื่อของระบบธนาคารพาณิชย์ปีนี้จะเติบโต 5% โดยได้แรงหนุนจากสินเชื่อรายย่อยและ SME ที่ฟื้นตัว",
        "topic": "Business"
    },
    {
        "headline": "ตลาดทองคำพุ่งทำสถิติสูงสุดใหม่",
        "body": "ราคาทองคำในประเทศปรับตัวสูงขึ้นต่อเนื่อง ทำสถิติสูงสุดใหม่ที่บาทละ 35,000 บาท นักลงทุนเข้าซื้อเป็นสินทรัพย์ปลอดภัยท่ามกลางความไม่แน่นอนทางเศรษฐกิจโลก",
        "topic": "Business"
    },
    {
        "headline": "นักวิจัยไทยพัฒนา AI ตรวจจับโรคมะเร็งระยะเริ่มต้น",
        "body": "ทีมนักวิจัยจากมหาวิทยาลัยชั้นนำของไทย ประกาศความสำเร็จในการพัฒนาระบบปัญญาประดิษฐ์ที่สามารถตรวจจับมะเร็งระยะเริ่มต้นได้แม่นยำถึง 95% ซึ่งจะช่วยลดอัตราการเสียชีวิตได้อย่างมาก",
        "topic": "SciTech"
    },
    {
        "headline": "บริษัทเทคโนโลยียักษ์ใหญ่เปิดตัวสมาร์ทโฟนรุ่นใหม่",
        "body": "บริษัทเทคโนโลยีระดับโลกเปิดตัวสมาร์ทโฟนรุ่นล่าสุด พร้อมเทคโนโลยี AI ในตัว กล้องความละเอียด 200 ล้านพิกเซล และแบตเตอรี่ที่ใช้งานได้นานถึง 2 วัน",
        "topic": "SciTech"
    },
    {
        "headline": "นักวิทยาศาสตร์ค้นพบยาต้านไวรัสชนิดใหม่",
        "body": "ทีมวิจัยจากสถาบันวิจัยทางการแพทย์ประกาศค้นพบสารต้านไวรัสชนิดใหม่ที่มีประสิทธิภาพสูงในการยับยั้งเชื้อไวรัสหลายสายพันธุ์ คาดว่าจะเข้าสู่การทดลองในมนุษย์ภายในปีหน้า",
        "topic": "SciTech"
    },
    {
        "headline": "SpaceX ส่งดาวเทียม Starlink เพิ่มอีก 60 ดวง",
        "body": "บริษัท SpaceX ประสบความสำเร็จในการส่งดาวเทียม Starlink เพิ่มอีก 60 ดวงขึ้นสู่วงโคจร เพื่อขยายเครือข่ายอินเทอร์เน็ตความเร็วสูงครอบคลุมทั่วโลก",
        "topic": "SciTech"
    },
    {
        "headline": "นักดาราศาสตร์ค้นพบดาวเคราะห์นอกระบบสุริยะดวงใหม่",
        "body": "ทีมนักดาราศาสตร์จากหอดูดาวนานาชาติค้นพบดาวเคราะห์นอกระบบสุริยะดวงใหม่ที่มีสภาพแวดล้อมคล้ายกับโลก อยู่ห่างจากโลกประมาณ 100 ปีแสง",
        "topic": "SciTech"
    },
    {
        "headline": "มหาวิทยาลัยไทยพัฒนาหุ่นยนต์ช่วยเหลือผู้สูงอายุ",
        "body": "คณะวิศวกรรมศาสตร์ มหาวิทยาลัยชั้นนำของไทย เปิดตัวหุ่นยนต์ผู้ช่วยสำหรับผู้สูงอายุ สามารถเตือนเรื่องยา ติดตามสุขภาพ และโทรแจ้งเหตุฉุกเฉินได้",
        "topic": "SciTech"
    },
    {
        "headline": "ผู้นำโลกประชุมสุดยอด G20 หารือวิกฤตเศรษฐกิจโลก",
        "body": "การประชุมสุดยอดผู้นำ G20 เริ่มต้นขึ้นแล้ว โดยมีวาระสำคัญเกี่ยวกับการแก้ไขปัญหาเศรษฐกิจโลก การเปลี่ยนแปลงสภาพภูมิอากาศ และความร่วมมือด้านสาธารณสุขระหว่างประเทศ",
        "topic": "World"
    },
    {
        "headline": "สหประชาชาติเรียกร้องหยุดยิงในตะวันออกกลาง",
        "body": "เลขาธิการสหประชาชาติออกแถลงการณ์เรียกร้องให้ทุกฝ่ายในความขัดแย้งตะวันออกกลางหยุดยิงทันที และเปิดทางให้ความช่วยเหลือด้านมนุษยธรรมเข้าถึงพลเรือน",
        "topic": "World"
    },
    {
        "headline": "ญี่ปุ่นและเกาหลีใต้จับมือกระชับความสัมพันธ์",
        "body": "ผู้นำญี่ปุ่นและเกาหลีใต้พบปะหารือทวิภาคี ตกลงกระชับความร่วมมือด้านความมั่นคงและเศรษฐกิจ หลังความสัมพันธ์ตึงเครียดมานานหลายปี",
        "topic": "World"
    },
    {
        "headline": "สหรัฐฯ ประกาศมาตรการคว่ำบาตรใหม่",
        "body": "กระทรวงการคลังสหรัฐฯ ประกาศมาตรการคว่ำบาตรใหม่ต่อบุคคลและองค์กรหลายราย เนื่องจากมีส่วนเกี่ยวข้องกับการละเมิดสิทธิมนุษยชน",
        "topic": "World"
    },
    {
        "headline": "อาเซียนจัดประชุมสุดยอดครั้งที่ 43",
        "body": "การประชุมสุดยอดอาเซียนครั้งที่ 43 เริ่มต้นขึ้น โดยมีวาระสำคัญเกี่ยวกับการรวมตัวทางเศรษฐกิจ ความมั่นคงทางทะเล และการเปลี่ยนแปลงสภาพภูมิอากาศ",
        "topic": "World"
    },
    {
        "headline": "UN เตือนวิกฤตผู้ลี้ภัยรุนแรงที่สุดในรอบทศวรรษ",
        "body": "สำนักงานข้าหลวงใหญ่ผู้ลี้ภัยแห่งสหประชาชาติ (UNHCR) รายงานว่าจำนวนผู้ลี้ภัยทั่วโลกพุ่งสูงเป็นประวัติการณ์ เกิน 100 ล้านคนเป็นครั้งแรก",
        "topic": "World"
    }
]